In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_csv('E:/All Project/salary_prediction/data/raw/web_data.csv')

In [5]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.7L Salaries11.8k Interviews2k Jo...,3.3
1,Accenture,71.1k Reviews6.5L Salaries9.1k Interviews34k J...,3.7
2,Wipro,63.7k Reviews4.8L Salaries6.6k Interviews5.9k ...,3.6
3,Cognizant,59.9k Reviews6L Salaries6.3k Interviews751 Job...,3.6
4,Capgemini,51.5k Reviews4.8L Salaries5.4k Interviews1.8k ...,3.7

In [9]:
df[df.duplicated()]

Empty DataFrame
Columns: [company_names, allas, company_reviews]
Index: []

In [7]:
df.drop_duplicates(inplace=True)

In [8]:
def drop_duplicates(data):
    df = data.drop_duplicates(inplace=True)
    return df

In [10]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.7L Salaries11.8k Interviews2k Jo...,3.3
1,Accenture,71.1k Reviews6.5L Salaries9.1k Interviews34k J...,3.7
2,Wipro,63.7k Reviews4.8L Salaries6.6k Interviews5.9k ...,3.6
3,Cognizant,59.9k Reviews6L Salaries6.3k Interviews751 Job...,3.6
4,Capgemini,51.5k Reviews4.8L Salaries5.4k Interviews1.8k ...,3.7

In [13]:
df['allas'][0]

'1.1L Reviews9.7L Salaries11.8k Interviews2k Jobs10.6k Benefits93 Photos'

In [15]:
df['allas'].str.split(' ')[0]

['1.1L',
 'Reviews9.7L',
 'Salaries11.8k',
 'Interviews2k',
 'Jobs10.6k',
 'Benefits93',
 'Photos']

In [ ]:
Reviews = df['allas'].str.split('Reviews').str[0]
Salaries =df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
Interviews = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
jobs = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
Benefits = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
photos = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]

0        1.1L
1       71.1k
2       63.7k
3       59.9k
4       51.5k
         ...
9975      106
9976      106
9977      106
9978      106
9979      106
Name: allas, Length: 9384, dtype: object

In [47]:
def data_corect(df):
    df['Reviews'] = df['allas'].str.split('Reviews').str[0]
    df['Salaries'] = df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
    df['Interviews'] = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
    df['jobs'] = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
    df['Benefits'] = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
    df['photos'] = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]
    df.drop(columns='allas',inplace=True)

    return df

In [48]:
data_corect(df)

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
0,TCS,3.3,1.1L,9.7L,11.8k,2k,10.6k,93
1,Accenture,3.7,71.1k,6.5L,9.1k,34k,6.7k,48
2,Wipro,3.6,63.7k,4.8L,6.6k,5.9k,4.6k,102
3,Cognizant,3.6,59.9k,6L,6.3k,751,5.5k,86
4,Capgemini,3.7,51.5k,4.8L,5.4k,1.8k,3.7k,42
...,...,...,...,...,...,...,...,...
9975,Mahaveer Group,2.7,106,508,11,8,7,--
9976,North West Carrying Co.,4.0,106,435,8,24,7,--
9977,Aster Pharmacy,3.5,106,417,8,--,3,--
9978,Migsun Group,3.0,106,563,7,--,4,--
9979,Bharat Parenterals,2.9,106,541,6,4,14,--

In [50]:
import pyodbc

conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=LAPTOP-1CCLVNBN;"
    "DATABASE=master;"
    "Trusted_Connection=yes;"
)

print("Connected successfully!")

OperationalError: ('08001', '[08001] [Microsoft][ODBC Driver 17 for SQL Server]Named Pipes Provider: Could not open a connection to SQL Server [2].  (2) (SQLDriverConnect); [08001] [Microsoft][ODBC Driver 17 for SQL Server]Login timeout expired (0); [08001] [Microsoft][ODBC Driver 17 for SQL Server]A network-related or instance-specific error has occurred while establishing a connection to SQL Server. Server is not found or not accessible. Check if instance name is correct and if SQL Server is configured to allow remote connections. For more information see SQL Server Books Online. (2)')